In [ ]:
# PROJECT WEEK 2

In [26]:
# importing required libraries
import pandas as pd
import numpy as np

In [27]:
# reading csv file 
data = pd.read_csv('/Users/noortjetaal/Downloads/bbga_latest_and_greatest (3).csv', sep=';')  
data.head()

   jaar gebiedcode15 variabele    waarde
0  2015         STAD     BBC_P      20.0
1  2005         STAD   BEV0_17  140615.0
2  2006         STAD   BEV0_17  139742.0
3  2007         STAD   BEV0_17  138806.0
4  2008         STAD   BEV0_17  138608.0

In [28]:
# rename columns in English columns 
data.columns = ['years', 'areacode15', 'variable', 'score']
data.head()

   years areacode15 variable     score
0   2015       STAD    BBC_P      20.0
1   2005       STAD  BEV0_17  140615.0
2   2006       STAD  BEV0_17  139742.0
3   2007       STAD  BEV0_17  138806.0
4   2008       STAD  BEV0_17  138608.0

In [30]:
# filter variables
filtered = data[(data['variable'] == 'VBUURTVEILIG_R') | (data['variable'] == 'VVEILIGDAG_R') | (data['variable'] == 'VVEILIGAVOND_R') | (data['variable'] =='VCRIMINALITEIT_R') | (data['variable'] =='VVEILIGVOELENALG_P') | (data['variable'] =='VVAAKVEILIGVOELENALG_P') | (data['variable'] =='VVEILIGVOELEN_P') | (data['variable'] =='VVAAKVEILIGVOELEN_P') | (data['variable'] =='LBUURT_R')]
filtered.head() 

# we use this filter because we want to compare the data of this variables over years

      years areacode15  variable  score
5040   2005       STAD  LBUURT_R    7.1
5041   2007       STAD  LBUURT_R    7.2
5042   2009       STAD  LBUURT_R    7.3
5043   2011       STAD  LBUURT_R    7.3
5044   2013       STAD  LBUURT_R    7.4

In [43]:
# filter years
filtered_yr = filtered[(filtered['years'] == 2015) | (filtered['years'] == 2016) | (filtered['years'] == 2017) | (filtered['years'] == 2018)] 
filtered_yr.head() 

# we used this filter because we want to compare all variables over the same years (we checked and some variables only have data from 2015)

      years areacode15        variable  score
5045   2015       STAD        LBUURT_R    7.5
5046   2017       STAD        LBUURT_R    7.5
5829   2015       STAD  VBUURTVEILIG_R    7.0
5830   2016       STAD  VBUURTVEILIG_R    7.0
5831   2017       STAD  VBUURTVEILIG_R    7.0

In [47]:
# checking the shape 
filtered_yr.shape

(13936, 4)

In [44]:
# check for missing values 
null_cols = filtered_yr.isnull().sum()
null_cols

# even though 3263 is quite high, the row is completely invaluable without that data. For that reason we are going to drop the rows.

years            0
areacode15       0
variable         0
score         3263
dtype: int64

In [49]:
# drop the rows with missing values 
final_data = filtered_yr.dropna()
final_data.head()

      years areacode15        variable  score
5045   2015       STAD        LBUURT_R    7.5
5046   2017       STAD        LBUURT_R    7.5
5829   2015       STAD  VBUURTVEILIG_R    7.0
5830   2016       STAD  VBUURTVEILIG_R    7.0
5831   2017       STAD  VBUURTVEILIG_R    7.0

In [50]:
# checking shape after drop 
final_data.shape

(10673, 4)

In [51]:
# checking if there are no missing values anymore 
null_cols = final_data.isnull().sum()
null_cols

years         0
areacode15    0
variable      0
score         0
dtype: int64

In [52]:
# which years are in the dataset  
final_data['years'].value_counts()

2017    3995
2015    3849
2016    1429
2018    1400
Name: years, dtype: int64

In [53]:
# exporting as sql file 
import pymysql
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:noortje1995@localhost/project 2') 

final_data.to_sql('project2', engine, if_exists='replace', index=False)